import React from 'react';
import './homePageStyle.css';
import image from "/Users/Amirg/שולחן העבודה/project-/project/src/images/mapp.png";

export default function HomePage() {
  return (
    <div className="home-page">
      <div className="video-container">
        <video id="home-video" autoPlay playsInline muted loop src="https://he.rafael.co.il/wp-content/uploads/2021/09/master_08.mp4" poster="" height="685"></video>
        <div className="overlay">
          <h2 className="main-title">SMART AND TO THE POINT</h2>
        </div>
      </div>
      <div className="content">
        <h2>ברוך הבא לאתר שלנו!</h2> 
        <p className="description-text">
          באתר שלנו תוצג מפת מצב דינמית של שדה הקרב, המציגה מיקומים בצבע צהוב המסמנים את מיקומם של חיילים, ומיקומים בצבע אדום המציינים איומים בשדה הקרב. <br /><br />
          בכל פעם שמתקבלת נקודת איום בסנסור של אחד החיילים, המצריכה יירוט הנקודה מוגדרת כמיקום מחבל ותסומן מיידית במפה, כך שכל החיילים יידעו להיזהר. <br /><br />
          בנוסף, בנקודת האיום מצוינים הגובה ביחס לחייל והזמן המדויק שבו התקבל האיום, מה שמאפשר לחיילים להעריך האם המחבל עדיין בקרבת מקום או שהתרחק. <br /><br />
          מידע זה חיוני לחיילים ולמפקדי פלוגות, כיוון שהוא מאפשר להם לנקוט אמצעי זהירות מתאימים בסביבת האיומים. יתר על כן, המידע משמש טייסים וכוחות ביטחון לביצוע חיסולים ממוקדים של מחבלים באזורים המסומנים באדום. <br /><br />
          הנקודות הצהובות על המפה, המציינות את מיקומי החיילים, מסייעות לטייסים ולשאר הכוחות למנוע ירי דו-צדדי, כלומר, מצב שבו טייסים או כוחות ביטחון יורים בטעות בחיילי הכוחות שלנו במחשבה שהם מחבלים. <br /><br />
          המפה נועדה לשימושם של חיילים בשדה הקרב המעוניינים לראות את האיומים שהתגלו בסביבתם הקרובה, ובכך להימנע מסכנות, להתחמק מהאויב, ואף להכותו בצורה יעילה יותר כאשר הם מודעים למיקומו המדויק.
          התמונה הבאה מציגה לנו את המפה, כפי שניתן לראות המיקום הצהוב מציין מיקום חייל והמיקומים האדומים מציינים מיקומי איומים שהתקבלו בסנסורים של החיילים!
        </p>
        <img src={image} alt="Descriptive Alt Text" className="content-image" />
      </div>
    </div>
  );
}
